davidweber/esp32-c6/WP-PRO_GATT_Server/main/include/reg_esp32c6_gpio.h
#define BP_GPIO_IN_RSVD31                                      31
#define BM_GPIO_IN_RSVD31                              0x80000000
#define BP_GPIO_IN_RSVD30                                      30
#define BM_GPIO_IN_RSVD30                              0x40000000
#define BP_GPIO_IN_D29                                         29
#define BM_GPIO_IN_D29                                 0x20000000
#define BP_GPIO_IN_D28                                         28
#define BM_GPIO_IN_D28                                 0x10000000
#define BP_GPIO_IN_D27                                         27
#define BM_GPIO_IN_D27                                 0x08000000
#define BP_GPIO_IN_D26                                         26
#define BM_GPIO_IN_D26                                 0x04000000
#define BP_GPIO_IN_D25                                         25
#define BM_GPIO_IN_D25                                 0x02000000
#define BP_GPIO_IN_D24                                         24
#define BM_GPIO_IN_D24                                 0x01000000
#define BP_GPIO_IN_D23                                         23
#define BM_GPIO_IN_D23                                 0x00800000
#define BP_GPIO_IN_D22                                         22
#define BM_GPIO_IN_D22                                 0x00400000
#define BP_GPIO_IN_D21                                         21
#define BM_GPIO_IN_D21                                 0x00200000
#define BP_GPIO_IN_D20                                         20
#define BM_GPIO_IN_D20                                 0x00100000
#define BP_GPIO_IN_D19                                         19
#define BM_GPIO_IN_D19                                 0x00080000
#define BP_GPIO_IN_D18                                         18
#define BM_GPIO_IN_D18                                 0x00040000
#define BP_GPIO_IN_D17                                         17
#define BM_GPIO_IN_D17                                 0x00020000
#define BP_GPIO_IN_D16                                         16
#define BM_GPIO_IN_D16                                 0x00010000
#define BP_GPIO_IN_D15                                         15
#define BM_GPIO_IN_D15                                 0x00008000
#define BP_GPIO_IN_D14                                         14
#define BM_GPIO_IN_D14                                 0x00004000
#define BP_GPIO_IN_D13                                         13
#define BM_GPIO_IN_D13                                 0x00002000
#define BP_GPIO_IN_D12                                         12
#define BM_GPIO_IN_D12                                 0x00001000
#define BP_GPIO_IN_RSVD11                                      11
#define BM_GPIO_IN_RSVD11                              0x00000800
#define BP_GPIO_IN_RSVD10                                      10
#define BM_GPIO_IN_RSVD10                              0x00000400
#define BP_GPIO_IN_D9                                           9
#define BM_GPIO_IN_D9                                  0x00000200
#define BP_GPIO_IN_D8                                           8
#define BM_GPIO_IN_D8                                  0x00000100
#define BP_GPIO_IN_D7                                           7
#define BM_GPIO_IN_D7                                  0x00000080
#define BP_GPIO_IN_D6                                           6
#define BM_GPIO_IN_D6                                  0x00000040
#define BP_GPIO_IN_D5                                           5
#define BM_GPIO_IN_D5                                  0x00000020
#define BP_GPIO_IN_D4                                           4
#define BM_GPIO_IN_D4                                  0x00000010
#define BP_GPIO_IN_D3                                           3
#define BM_GPIO_IN_D3                                  0x00000008
#define BP_GPIO_IN_D2                                           2
#define BM_GPIO_IN_D2                                  0x00000004
#define BP_GPIO_IN_D1                                           1
#define BM_GPIO_IN_D1                                  0x00000002
#define BP_GPIO_IN_D0                                           0
#define BM_GPIO_IN_D0                                  0x00000001

//------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__

typedef union reg_gpio_pin_u
{
  uint32_t V;
  struct reg_gpio_pin_s
  {
    uint32_t D0                  :1;
    uint32_t D1                  :1;
    uint32_t D2                  :1;
    uint32_t D3                  :1;
    uint32_t D4                  :1;
    uint32_t D5                  :1;
    uint32_t D6                  :1;
    uint32_t D7                  :1;
    uint32_t D8                  :1;
    uint32_t D9                  :1;
    uint32_t RSVD10              :1;
    uint32_t RSVD11              :1;
    uint32_t D12                 :1;
    uint32_t D13                 :1;
    uint32_t D14                 :1;
    uint32_t D15                 :1;
    uint32_t D16                 :1;
    uint32_t D17                 :1;
    uint32_t D18                 :1;
    uint32_t D19                 :1;
    uint32_t D20                 :1;
    uint32_t D21                 :1;
    uint32_t D22                 :1;
    uint32_t D23                 :1;
    uint32_t D24                 :1;
    uint32_t D25                 :1;
    uint32_t D26                 :1;
    uint32_t D27                 :1;
    uint32_t D28                 :1;
    uint32_t D29                 :1;
    uint32_t RSVD30              :1;
    uint32_t RSVD31              :1;
  }BF;
} reg_gpio_pin_t;

#endif  // __LANGUAGE_ASM__

#define REG_GPIO_PIN(N)       (*(volatile reg_gpio_pin_t*)((GPIO_PIN_REG_ADDR(N))))
#define REG_GPIO_PIN_ADDR(N)  (GPIO_PIN_REG_ADDR(N))

#define BP_GPIO_PIN_RSVD31                                     31
#define BM_GPIO_PIN_RSVD31                             0x80000000
#define BP_GPIO_PIN_RSVD30                                     30
#define BM_GPIO_PIN_RSVD30                             0x40000000
#define BP_GPIO_PIN_D29                                        29
#define BM_GPIO_PIN_D29                                0x20000000
#define BP_GPIO_PIN_D28                                        28
#define BM_GPIO_PIN_D28                                0x10000000
#define BP_GPIO_PIN_D27                                        27
#define BM_GPIO_PIN_D27                                0x08000000
#define BP_GPIO_PIN_D26                                        26
#define BM_GPIO_PIN_D26                                0x04000000
#define BP_GPIO_PIN_D25                                        25
#define BM_GPIO_PIN_D25                                0x02000000
#define BP_GPIO_PIN_D24                                        24
#define BM_GPIO_PIN_D24                                0x01000000
#define BP_GPIO_PIN_D23                                        23
#define BM_GPIO_PIN_D23                                0x00800000
#define BP_GPIO_PIN_D22                                        22
#define BM_GPIO_PIN_D22                                0x00400000
#define BP_GPIO_PIN_D21                                        21
#define BM_GPIO_PIN_D21                                0x00200000
#define BP_GPIO_PIN_D20                                        20
#define BM_GPIO_PIN_D20                                0x00100000
#define BP_GPIO_PIN_D19                                        19
#define BM_GPIO_PIN_D19                                0x00080000
#define BP_GPIO_PIN_D18                                        18
#define BM_GPIO_PIN_D18                                0x00040000
#define BP_GPIO_PIN_D17                                        17
#define BM_GPIO_PIN_D17                                0x00020000
#define BP_GPIO_PIN_D16                                        16
#define BM_GPIO_PIN_D16                                0x00010000
#define BP_GPIO_PIN_D15                                        15
#define BM_GPIO_PIN_D15                                0x00008000
#define BP_GPIO_PIN_D14                                        14
#define BM_GPIO_PIN_D14                                0x00004000
#define BP_GPIO_PIN_D13                                        13
#define BM_GPIO_PIN_D13                                0x00002000
#define BP_GPIO_PIN_D12                                        12
#define BM_GPIO_PIN_D12                                0x00001000
#define BP_GPIO_PIN_RSVD11                                     11
#define BM_GPIO_PIN_RSVD11                             0x00000800
#define BP_GPIO_PIN_RSVD10                                     10
#define BM_GPIO_PIN_RSVD10                             0x00000400
#define BP_GPIO_PIN_D9                                          9
#define BM_GPIO_PIN_D9                                 0x00000200
#define BP_GPIO_PIN_D8                                          8
#define BM_GPIO_PIN_D8                                 0x00000100
#define BP_GPIO_PIN_D7                                          7
#define BM_GPIO_PIN_D7                                 0x00000080
#define BP_GPIO_PIN_D6                                          6
#define BM_GPIO_PIN_D6                                 0x00000040
#define BP_GPIO_PIN_D5                                          5
#define BM_GPIO_PIN_D5                                 0x00000020
#define BP_GPIO_PIN_D4                                          4
#define BM_GPIO_PIN_D4                                 0x00000010
#define BP_GPIO_PIN_D3                                          3
#define BM_GPIO_PIN_D3                                 0x00000008
#define BP_GPIO_PIN_D2                                          2
#define BM_GPIO_PIN_D2                                 0x00000004
#define BP_GPIO_PIN_D1                                          1
#define BM_GPIO_PIN_D1                                 0x00000002
#define BP_GPIO_PIN_D0                                          0
#define BM_GPIO_PIN_D0                                 0x00000001


//-----------------------------------------------------------------------------

#ifdef __cplusplus
}
#endif

#endif //__REG_ESP32C6_GPIO_H__

